In [2]:
import pandas as pd 
import seaborn as sns

In [5]:
df = sns.load_dataset("tips")

In [6]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
df.set_option()

In [10]:
df.select_dtypes(include=['int64','float64'])

     total_bill   tip  size
0         16.99  1.01     2
1         10.34  1.66     3
2         21.01  3.50     3
3         23.68  3.31     2
4         24.59  3.61     4
..          ...   ...   ...
239       29.03  5.92     3
240       27.18  2.00     2
241       22.67  2.00     2
242       17.82  1.75     2
243       18.78  3.00     2

[244 rows x 3 columns]

In [12]:
df.select_dtypes(include=['object'])

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[244 rows x 0 columns]

In [26]:
df =pd.DataFrame({'co1':[1,2,3,4,5],
              'col2':[452,34,234,45,234],
              'col3':'Aurn  krish ineruoron one nuewoer'.split()
              })

In [27]:
df['col3']

0         Aurn
1        krish
2    ineruoron
3          one
4      nuewoer
Name: col3, dtype: object

In [29]:
df['col4'] =df['co1']**2

In [30]:
df['col4']

0     1
1     4
2     9
3    16
4    25
Name: col4, dtype: int64

In [46]:
df['col5'] = df['col3'].str[0]

In [47]:
df

   co1  col2       col3  col4 col5
0    1   452       Aurn     1    A
1    2    34      krish     4    k
2    3   234  ineruoron     9    i
3    4    45        one    16    o
4    5   234    nuewoer    25    n

In [50]:
df['col6'] = ['s' if df['col5'][i]=='s' else 'z' for i in range (len(df['col5']) )]

In [54]:
def test(a):
    return a**2
df['col7'] = df['col2'].apply(test)

In [55]:
df

   co1  col2       col3  col4 col5 col6    col7
0    1   452       Aurn     1    A    A  204304
1    2    34      krish     4    k    Z    1156
2    3   234  ineruoron     9    i    Z   54756
3    4    45        one    16    o    Z    2025
4    5   234    nuewoer    25    n    Z   54756